﻿[language]

;Language name 

name=Magyar

[firstrun]
chooselanguage=Nyelv beállítása.
ok=OK
ignore=Ignore
oldini=Restore your configuration from a previous installation?
loadini=Importálás
loadfail=The configuration file was not found.
loadsuccessful=Importálás sikeres! 
steambak=Do you want to import your configuration files stored on the Steam cloud? 
steamerror=A critical error has occured due to corrupted files. Please verify your file integrity via Steam.

[steam]
save=Konfiguráció mentése a Steam felhőbe
load=Restore the Steam cloud configuration
steamnotrun=Need to run Steam to use this feature!
uploadfilemaxsize=The maximum size of the uploaded file is 100 MB


[workshop]
list_install=Telepítve
list_home=Kezdőlap
list_subscribe=Feliratkozva
list_upload=Feltöltve
list_voteup=Kedvencek
list_themesskin=Skins and Themes
list_widget=Component style


subscribe=Subscription
unsubscribe=Unsubscribe

deltheme=Téma törlése

newtheme=Új téma
newthemetip=Please enter the theme name

edittheme=Szerkesztés


icons=Ikonok
dockskin=Skins
Single icon=Single icon
Time skin=Time skin
Calendar skin=Calendar skin
Sound=Hang
language=Nyelv

sort_alltime=mind
sort_week=hét
sort_month=hónap
sort_year=év

sort_hot=Népszerű
sort_new=Legújabb
sort_sub=Subscription
sort_vote=Értékelés

filesize=Fájl méret
updatetime=Last update time

opensteam=Steam megnyitása
runerror=Steam needs to be running to use this feature!

[themesedit]
View=Nézet
Sort by=Rendezés
Group by=Csoportosítás
refresh=Frissítés
showicons=Asztali ikonok megjelenítése

sort_none=Nincs
sort_bigicon=Nagy ikonok
sort_mediumicon=Közepes ikonok
sort_smallicon=Kis ikonok
sort_superbigicon=Oversized icons
sort_list=Lista
sort_details=Részletek
sort_tile=Tile
sort_content=Content
sort_name=Név
sort_size=Méret
sort_type=Tipus
sort_time=Dátum
sort_ascending=Ascending
sort_descending=Descending
sort_AutoArrange=Icons are arranged automatically
sort_snaptogrid=Automatically arrange icons aligned to the grid


shell=Megjelenés
offset=Offset
Delimiter and run=Delimiter & run indicator
Progress bar=Progress bar

savetheme=Mentés

applytheme=Does saving successfully apply this theme immediately?
filetip_drop=Drag and drop the picture here
filetip=Click or drag and drop the image directly here
dropfile=Do you want to replace this image?

selectpicture=Select an image
cliptip=crop
clipleft=left
clipbottom=hemline
clipright=right
cliptop=Top edge

dockbg=Háttér
dockblur=Blur the background
Progress bar border=Keret
Progress bar bg=Háttér
Run indicator=Run indicator
Run offset=Offset
delimiter=Elválasztó
Margins=Margins
Margins trimmer=Margin fine-tuning (recommended values 0-0.2)

folder=Mappa
trash_empty=Kuka(üres)
trash_full=Kuka (tele)

calmon=hónap
calday=dátum

timebg=Háttér
timehour=óra
timeminute=perc
timesecond=másodperc

timetype=Clock type
timetype_pointer=pointer
timetype_number=digit
fontname=The font name
fontsize=Font size
fontalign=Text alignment
fontpoint=Text coordinates
format=Time format
fontcolor=Text color

workshopshare=Do you upload themes to the Workshop?
sharesuccess=Successfully uploaded to the Workshop!
sharefailed=Feltöltés sikertelen!

workshop_Preview=Előnézet
workshop_description=description
workshop_otherPreview=More previews
workshop_Previewbuild=Automatically generated
workshop_Previewselect=Select the image
workshop_tip_description=Please enter a description of the topic

[systeminfo]
cpu=Processzor
gpu=Grafika
memory=Memória
system=OS
moreinfo=Több infó

[monitor]
process=Folyamatok
readwrite=Olvasás/írás
usage=Használat


;------------------------------------
[tips]
GeolocationTip=A Wi-Fi használatához engedélyezni kell a rendszer helymeghatározását. Kattintson ide, hogy megtudja miért.

dropiconerror=Az ikonok nem húzhatók, ha többképernyős Dock megjelenítés engedélyezve van. Válasszon egyképernyős Dock megjelenítést!

msitip=MSI Afterburner-rel való esetleges ütközés észlelve. Felvenni a kivételek közé?

openUACtip=If UAC is detected that the system has been turned off, it may not be possible to use the file dragging and dropping to the dock to open the function.
openUACtip1=UAC is enabled successfully, you need to restart the system to take effect, do you need to restart the system immediately?
openUACtip2=UAC failed to open!

crashtip=An error has forced MyDockFinder to close. Would you like to restart it?
;------------------------------------

[iconame]

;dock Label name
createlnk=Parancsikon létrehozása

explorer=Fájlkezelő
launchpad=Launchpad
cal=Naptár
trash=Kuka

;The last icon in the folder interface

exploreropen=Megnyitás fájlkezelőben
return=Go back

;System time icon label name format

timeformat=éééé/H/n nnnn
;The time format is the system time format   y    m ·  d      dddd    ڼ   ddd ܼ 


remove=Eltávolítás

;------------------------------------------------------------

[systemicon]
;System icon name
controlpanel=Vezérlőpult
taskbar=Tray icon
systemtime=System Time
network=Helyi Hálózat
weather=Időjárás
battery=Akkumulátor
startmenu=Start menü
virtualdesktop=Virtuális asztal


------------------------------------

[editicon]
;Edit icon window

addtips=Files can be dragged and dropped here

reset=Alaphelyzet
ok=OK
restore=Visszaállítás
addname=Név szerkesztése
addicotips=Click the top right button to add an icon.
switch=Switch
trashempty=Trash empty
trashfull=Trash full
iconshell=Scale icon to macOS standards
addline=Parancs végrehajtása

Icon Designer title=Ikon szerkesztő
Icon Designer=Szerkesztés
select=Fájl választása

share=Megosztás
icolabel=Ikon
selectpicture=Kiválasztás
icosize=Icon scale
icooffsetx=Horizontal icon offset
icooffsety=Vertical icon offset
icobackground=Háttérkép
iconshadow=Use Icon Shadows
icoroundrect=Rounded shape angle
icocolor=Szín
icogradient color=Use gradient colors
icocolorangle=Gradient color angle

;Pop up select file window title

selectfoldertitle=Mappa választása
;Weather forecast search city
searchcity=Város keresése


;------------------------------------

[editcal]

;Edit calendar window

monfontsize=Month font size:
dayfontsize=Date font size:

monthfont=Month font:
dayfont=Date font:
monthpoint=Month location:
daypoint=Date location:
monthposition=Month alignment:
dayposition=Date alignment:
monthcolor=Month color:
daycolor=Date color:
rotation=Rotation angle:
default=Use default settings

ok=OK
test=Teszt

left=Bal
right=Jobb
center=Középen

;Pop up select picture window title

selectcalicon=Choose a calendar picture

;------------------------------------

[editicontips]
;An error message pops up on the edit icon interface

iconduplicate=This program is already in the Dock.

titleerror=The program display name cannot be empty.
filepatherror=The program path and icon cannot be empty.

padtitleerror1=The file name already exists, please enter a different name.
padtitleerror2=Modifying the file has failed,  please do not put the program on the 'C' drive!

workshopshare=Upload this icon to the workshop?
workshopsharesuccess=The icon has been successfully uploaded to the workshop!
workshopsharefailed=Ikon feltöltése sikertelen.

formaterror=Unsupported format. Only files in .png, .ico, .exe,  and .lnk formats are supported.

;---------------------------------------------------------------------------

[weatherUI]
Other locations=Egyéb helyek  
open weather=Időjárás megnyitása  

Select location=Város helyének kiválasztása  
Edit location name=Város megjelenített nevének szerkesztése  

add=Hozzáadás  
edit=Szerkesztés  
delete=Törlés

location=Rendszer helymeghatározása
search=Keresés
latitude&longitude=Földrajzi koordináták


;Preferences window
[settingUI]
cloudini=Steam felhő mentés
uploadcloudini=Archívum feltöltése
nofoundini=The archive is not uploaded
downloadcloudini=Archívum letöltése
managesteamcloud=Manage files
cloudfile=Steam felhő fájlok
uploadcloudfile=Fájl feltöltése
filename=Fájlnév
filesize=Fájlméret
filetime=Upload time

settitle=MyDockFinder beállítások

backupsuccess=Data backed up successfully.
backupfail=Failed to upload backup.


Global Settings=Általános

openMyDock=myDock engedélyezése
openMyFinder=myFinder engedélyezése
debugMyDockFinder=Futtatás hibakeresési módban


gameautoclose=Automatikus kilépés teljesképernyős játék közben
ProcessRecentFiles=Displays the number of files recently opened by the program

DPIscale=Global interface scale
Globalblurvalue=Global interface blur intensity
Accentcolor=Kiemelés színe
darkmodeall=Megjelenés

darkmode_light=Világos
darkmode_dark=Sötét
darkmode_auto=Automatikus
darkmode_system=Rendszer követése
uiaccesstop=Display MyDockFinder above all other windows

screenfps=Globális renderelési frissítési gyakoriság kiválasztása

Temperature Celsius Fahrenheit=Globális hőmérséklet-egység

aero=Turn on the global blur effect
systemdarkmode=Match system color scheme with MyDockFinder
autoupdate=Frissítések automatikus keresése
systemstart=Automatikus indítás
none=Ne induljon automatikusan
regedit=Registry Value
plantask=Ütemezett feladatként
Service=Indítás szolgáltatásként

windowscenterscreen=The new window is displayed in the center of the screen
showhidetaskbar_hotkey=Show or hide the taskbar hot keys

autohidetaskbar=Automatically hide the taskbar on boot

hidetaskbar_dock=Hide the taskbar on the Dock display
hidetaskbar_all=Hide taskbar on all displays

languagechoice=Megjelenítés nyelve
allfont=Betűtipus
usefontbold=Félkövér betű használata mindig
fontscale=Modify the global font scaling
fontQuality=Kiváló minőségű betűkép-megjelenítés


themes=Megjelenés

customize_blur=Blur intensity
customize_opacity=Átlátszóság
customize_stroke=Border transparency

customize_enabled_dockbg=Make Dock use custom blur and transparency values
customize_enabled_iconreflection=Make pinned icons reflect from the Dock
customize_blur_iconreflection=Reflection blur strength
customize_opacity_iconreflection=Reflection transparency
customize_offset_iconreflection=Adjust the icon reflection distance
customize_stoppoint_iconreflection=Az ikon tükröződése színátmenettávolságának beállítása

customize_enabled_icontag=Make Dock icon labels use custom blur and transparency values
customize_enabled_menu=Make context menus use custom blur and transparency values
customize_enabled_window=Make MyDockFinder menus use custom blur and transparency values
customize_enabled_finder=Make Finder use custom blur and transparency values
customize_opacity_wallpapercolor=Wallpaper tint intensity
customize_enabled_folder=Make the folder contents grid use custom blur and transparency values
customize_enabled_foldersize=Folder interface uses custom icon size

customize_enabled_pad=Launchpad uses custom background blur
customize_enabled_pad_backdrop=Display Launchpad above windows instead of hiding them
customize_enabled_pad_winuiwallpaper=Launchpad blurs the background instead of pre-rendering it
selectthemes_icon=Ikon téma
selectthemes_dockskin=Dock skin


general=Look & Behaviour
advanced=Haladó
preview=Ablak előnézet
minimizewindowsettings=Minimize Effects
systrayicoset=Rendszertálca-ikonok
screenset=Kijelző
timeset=Idő és dátum
notificationset=Értesítések

audioset=Audió
displayset=Kijelző
mediaset=Média
batteryset=Akkumulátor
netset=Hálózat
monitorset=Hardver állapot
windowsanimationset=Ablak animáció
WindowManagement=Ablakkezelés
windownotfullscreenadd=Nem teljes képernyős ablak hozzáadása
gamewindowadd=Játékablak hozzáadása
gamewindowslist=Játékablaklista kezelése
gamewindowslistdel=Játékablak törlése
nogamewindow=Nincs játékablak
Minimize Screenshot method=Minimalizálási animáció képernyőkép módja



about=Névjegy

icosize=Ikon méret

icoeffect=Icon effect

dockeffect_none=Nincs
dockeffect_scale=Scaling
dockeffect_select=Select
dockeffect_light=illumination
dockeffect_scaleandlight=Scaling and light
dockeffect_selectandlight=Select and light
icolightvalue=Icon light intensity
icobglightvalue=Icon background light intensity
icobglightcolor=Icon background light color
icomaxsize=Icon magnification

icospace=Distance between icons
edgeposition=Dock distance from screen edge
iconimmersion=A dokkoló üresjáratban merülő üzemmódot használ
dockicoImmersion_delay=Immerszív mód megjelenési késleltetési ideje

displaymode=Dock display mode
displaynormal=Alapértelmezett
displaybottom=Overlay
displayauto=Auto-hide 
displaysmart=Smart auto-hide
displayhotkey=Only display with 
displayalways=Always show
displayhide=Always hide
displayalwaysshow=Always force visibility
displaydesktop=Display only on the desktop
showmodewindows=Select how the Dock shows and hides the detection window
showhidetest_exe=The current program window
showhidetest_all=All program windows

showhidetype=Select the Dock to show the hidden effect

showhideeffect_move=move
showhideeffect_opacity=Fade away

activation Dock Type=A Dock megmutatja, hogyan aktiválták
showdockact_mouse=A képernyő széle
showdockact_bar=Aktiváló sáv

actbar_weight=Activation bar width
actbar_height=Activation bar height
actbar_offset=Activation bar distance from screen edge
mouseactdock=Mouse delay activates dock time



positiononscreen=Elhelyezkedés a képernyőn on screen
screenleft=Balra
screenbottom=Középne
screenright=Jobbra
screentop=Fent

multiscreen=Select the screen to display Dock
multiscreenpad=Select the screen to display Launchpad

padicotype=Choose which icons will be displayed by Launchpad
padicotype_normal=Added icons
padicotype_startmenu=Start menü
padicotype_desktop=Asztal
padicosize=Launchpad icon size
padicospacex=Icon horizontal spacing
padicospacey=Icon vertical spacing
padicoblacklist=Edit the deleted Start Menu program
padblacklist=Manage lists

hidepadicostring=Ikon szöveg elrejtése

padscreenname=Dock követése

HDicons=Kiváló minőségű ikon renderelés  

lockicon=Lock icon dragging
showicontag=Show icon labels
windowsborder=Turn on window borders to prevent windows from hiding Dock and Finder
jumpanimation=Animate opening applications
folderDoubleclickOpen=Double-click the folder icon to open in Finder
foldernoshowopen=Hide the open folder button
iconmask=Scale all icons to macOS standards
icomasktype=Globális ikon maszk stílus
Explorer window=Explorer ikon Csak futtatás észlelő ablak
hidedockdelay=Késleltetett elrejtési dokkolási idő

show indicators=Show indicators under running programs
Runapp separator=Separate unpinned running programs
runiconallscreen=Új futó programok ikonjainak megjelenítése minden képernyőn
newapp=Show icons of unpinned running programs
blacklist=Manage running program blacklist
noblacklist=Disable program blacklist
hotcornerleft=Bottom left hot-corner function
hotcornerright=Bottom right hot-corner function
hotkeypad=Show Launchpad shortcut
hotkeyDock=Show Dock shortcut
hotkeyborder=Window border toggle shortcut

dockicobackup=Dock layout backup
backuplist=Manage backup files
Addbackupdockico=Add layout backup
locationbackup=Open backup location

minimize=Use MyDockFinder minimize effect
animationoff=Don't animate minimizing windows
Slow animation=Hold down 'Shift' to slow down an animation
minimizeeffect=Minimize animation

genie=Genie
scale=Scale
scaleDX=Scale DirectX
suck=Suck
minimizeAnimationspeed=Minimize animation speed
Minimize to icon=Minimize windows into their Dock icon
Minimize dynamics=Dynamically display window content when minimized
minimizeAnimationWait=Várja meg, amíg a minimalizált ablak animációja rendereli a képkockákat

Minimizeblacklist=Minimize animation blacklist
Editwindowlist=Edit window list

minicopos=Minimize window icon position
dockmin_lastico=Next to the icon on the right
dockmin_right=Independently displayed on the right
dockmin_rightandlim=The right side is displayed independently using a separator

previewon=Enable window previews
previewsize=Window preview size
previewdelay=Preview delay on hover

previewcontrol=Show preview elements
previewappname=Application name
previewbutton=Window control buttons
aeropeek=Show native window preview on hover

finderbgtype=Válassza ki a MyFinder háttérstílusát

hotkeyfinder=MyFinder gyorsbillentyűk megjelenítése

finderheight=MyFinder magasság beállítása  
finderoffsety=Függőleges elrendezés eltolás módosítása  
finderbuttonw=Gombok közötti távolság beállítása  

hidefinderdelay=MyFinder elrejtésének késleltetése  

showfocusassist=Fókusz asszisztens megjelenítése  

logotype=MyFinder menü ikon
diylogo=Fájl választása
shutdownmsgbox=Shut down confirmation box
finderdark=Finder appearance
showmediacontrol=Displays the media playback icon
showuseraccount=The account icon is displayed
mouseactfinder=Egér késleltetés aktiválása MyFinder idő
showusbdevice=Megjelennek a cserélhető USB-lemezek
showweather=Időjárás-előrejelzés megjelenítése

systemtraycolor=Show colored tray icons
showkeyboard=Show input method menu
showsearch=Keresés ikon mutatása
showLyrics=Show music player lyrics menu
showLyrics_color=Show Color Player Lyrics

musiccontrolshowmode=Display media controls
musiccontrol_close=Ne mutassa soha
musiccontrol_activity=When lyrics are displayed
musiccontrol_always=Mindig mutassa


finderdark_auto=Follow wallpaper color
finderdark_set=Rendszer követése

multiscreenfinder=Select which screens display Finder
findershowallscreens=Összes képernyő

finderdisplaymode=Auto-Hide Finder
finderautochangecolor=Maximized windows affect Finder appearance
finderfastclosewindow=Click the upper right corner to close the current maximized window

finderlockbtn=Lock dragging tray icons
myfinderscaleopen=Use custom scaling

stagemanagerset=Stage Manager
showstagemanager=Show Stage Manager icon in MyFinder
stagemanageronlywindowslist=Csak az ablaklistát mutassa, a háttérben lévő ablakok elrejtése nélkül

showstagemanagerwindowtitle=Show window title on mouseover
showstagemanagerdesktophidewindows=Click on the desktop to hide all windows
showstagemanagermediaplaypause=Automatically pause and play background window media
stagemanager_hotkey=Stage Manager Hotkeys

stagemanagerblacklist=Programs Excluded from Stage Manager

stagemanager_showdesktop=show desktop icons
desktopico_hide=always hide icon
desktopico_auto=auto show hide
desktopico_show=always show

stagemanager_enable=Open Stage Manager
stagemanager_listpos=The screen position where the window list is located
stagemanager_listshowmode=Window List Show Hidden Mode

stagemanager_windowsize=Window list icon size
stagemanager_windowspace=Window list icon spacing
stagemanager_windowcount=Number of window list icons
stagemanager_windowsblur=Blur background window icons


findershowmenu=Show window options in Finder
finderhidemenudelay=Egyéb programok menüsorainak elrejtésének késleltetése

showaudio=Show volume menu in Finder
showmicrophone=Show microphone usage icon in Finder

showbattery=Show Battery Status menu in Finder
shownetwork=Show Internet Connection menu in Finder
showbluetooth=Show Bluetooth menu in Finder
showdisplay=Show Displays menu in Finder

showbatterytime=Displays the remaining battery time
batteryshow_none=Nem jelenik meg
batteryshow_acdc=Mindig megjelenítve
batteryshow_ac=Tápegység használata esetén
batteryshow_dc=Elemek használata esetén

powerset_open=Automatically switch power plans
powerset_aconline=Power plans when using power
powerset_battery=Power plans when using batteries

bluetooth_showbattery=Csatlakoztatott Bluetooth eszközök mutatása
bluetooth_not show=Ne mutassa
bluetooth_icon=Csak ikonok mutatása
bluetooth_value=Ikonok és akkumulátor állapot mutatása

monitorcolor=Kiemelés, ha a használat túl magas

showcpu=Processzor
showtemp=Hőmérsékletek
showmen=Memória
showdisk=Tárhely
shownet=Hálózat

Calendarfirstday=A hét első napja
Calendar_Sunday=Vasárnap
Calendar_Monnday=Hétfő

formatdate=Dátum formátuma:
formattime=Idő formátuma:
customformatdate=Customize the date display format
customformattime=Customize the time display format

showbatteryvalue=Show Battery percentage in Finder status menu
audiotip=Play sound on volume change
mediatype=Volume and brightness style

media_system=Windows
media_speakers=macOS
media_phone=iOS/iPadOS

hotkeyvolup=Volume up shortcut
hotkeyvoldown=Volume down shortcut
hotkeyvolmute=Volume mute shortcut
hotkeymicup=Microphone volume up shortcut
hotkeymicdown=Microphone volume down shortcut
hotkeymicmute=Microphone mute shortcut


hotkeybriup=Brightness up shortcut
hotkeybridown=Brightness down shortcut
hotkeycontrolvalue=A gyorsbillentyű értékének beállítása a növeléshez vagy csökkentéshez

systemnotification=Rendszer értesítések
usbdevicenotification=Show removable disk connection and pop-up notification
bluetoothdevicenotification=Show Bluetooth device connection notification
Appnotification=App notifications
notification_open=Értesítések engedélyezése
notification_type=Notification banner behaviour
notification_time=Banner notification display length
notification_show_close=Never show banner
notification_show_once=Show only once
notification_show_always=Always show

trayicoallshow_myfinder=Always display all tray icons in Finder
trayicoallshow_mydock=Always display all tray icons in Dock
trayicoallshow_systemico=Displays the system's own tray icon in MyFinder
trayico_waittime=Az újonnan futtatott tálca ikon mutatja az időt

Apptrayico=App Tray Icons
apptrayicoshow_finder=Show tray icon in Finder
apptrayicoshow_dock=Show tray icon in Dock
acttrayicotype=Válassza ki a tálca ikon aktiválásának módját

screenround=Display rounded corners
screenround_show=Enable rounded corners on this display
screenround_size=Screen rounded corner radius
screenround_color=Szín

openwindowsshow=Window opening animation
windowsopeneffect=Window opening animation effect

openwindowsclose=Enable Window close animation
windowscloseeffect=Window close animation effect
windowsblacklistadd=Add Excluded Programs window
windowsblacklistdel=Remove windows for excluded programs
windowsclose_animation=Adjust animation speed

stagemanager_animation=Adjust animation speed
mediatiptime=Volume brightness prompt display time

other=Egyéb

wallpaper=Dinamikus háttérképek

selectwallpaper=Dinamikus háttérkép
wallpapernone=Nincs dinamikus háttérkép
loadwallpaper=Load dynamic Wallpaper
wallpaperdownload=Download dynamic wallpaper from the website
wallpaperOK=Alkalmazás 

restartdock=MyDockFinder újraindítása


resetini=Adat törlése
resetini_ok=Eltávolítás
resetini_config=Preferences Profile
resetini_ico=Dock Icon Profile
resetini_padico=App Library Icon Profile
resetini_padicocache=App Library icon cache

systemiconcache=System icon cache

uninstall=Eltávolítás

updatelog=Változások
updatelogcheck=Nézet

ok=OK
cancel=Mégse

------------------------------------------------------------
[hotcorners]
nothing=Do nothing
allwindows=Show all windows
launchpad=Launchpad megnyitása
displaytosleep=Put display to sleep
startmenu=Start menü megnyitása
showdesktop=Asztal megjelenítése
actioncenter=Open Mission Control
screensaver=Lock Screen
Windows widget=Windows widget


[settingtips]

;An error message pops up on the setting interface
fontQualitytips=A nem támogató rendszerek összeomolhatnak. Kattintson OK-ra a teszteléshez.
fontQualityFailedtips=Sikertelen teszt. A rendszer nem támogatja.
fontQualityfuccesstips=Kiváló minőségű megjelenítés bekapcsolva! Néhány felület újraindítást igényel.

backupsuccess=Feltöltés sikeres!
backupfail=Feltöltés sikertelen!

hotkeyhideerror=Please set to display Dock shortcut key or this function may not work!
resetinitip=Do you want to reset the config file?
systemicontip=Do you want to clear the system icon cache?

winuiwallpapertip=This setting is unstable and may make your PC crash. If that happens, disable the setting after a reboot, then reopen MyDockFinder.

DPItips=Some interface elements won't reflect this change until MyDockFinder is restarted.

padicotypetips=This change will reset all icons in Launchpad, are you sure you want to do this?

edgetip= The boundary of the open limit window cannot be adjusted!
autohideerror= This function cannot be enabled when opening the window boundary!
neterror=Connection failed,  please check your connection.
autohide=Auto-hide has failed to enable.
updateerror1=Connection error,  please try again.

updatetip1=Is there a new update?
updatetip2=Is the program auto-updated?

noupdate=The latest version is already installed.

restarttip=The program will have to be restarted in order to apply this change.

languagetips=Some interfaces need to be restarted to change!

restartruntip=Do you want to restart the program?

backupfolderror=Failed to create the backup folder,  please ensure that the directory isn't read-only.

backuptips=Do you want to restore this backup file?


;-------------------------------------------------------------------

[menu]
;Right menu
reboot explorer=Indítsa újra a  weboldalt.

closewindows=Zárja be az ablakot

RecentFiles=Recently opened files
otheroption=Opciók
dockmenu=MyDockFinder menü
preference=MyDockFinder beállítások
enddock=MyDockFinder bezárása

menurecent=Recently visited
menubind=Fixed
menutask=task

edit_cut=Kivágás
edit_copy=Másolás
edit_paste=Beillesztés
edit_selectall=Select all
edit_delete=Törlés
edit_openurl=Webhivatkozás megnyitása

workshop=Workshop
newfinderwindow=Új Finder ablak
gotofolder=Go to
connecttoserver=Remote connect to
showlaunchpad=Launchpad megnyitása


addnormalicon=Alkalmazás ikon hozzáadása
addsystemicon=Rendszer ikon hozzáadása
add delimiter=Elválasztó hozzáadása
del delimiter=Elválasztó eltávolítása

showtaskbar=Tálca megjelenítése
hidetaskbar=Tálca elrejtése

editicon=Ikon szerkesztése
removefromdock=Eltávolítás a Dockról
keepindock=Keep in Dock
locationfile=Open app location
runagain=Run this app again
nevershowthis=Hide this app icon
adminmode=Futtatás rendszergazdaként
open=Megnyitás
quit=Kilépés

emptytrash=Kuka ürítése
sortorder=Rendezés
Byname=Név
Bysize=Méret
Byextension=Tipus
Bydate/time=Módosítás dátuma
Createtime=Készítés dátuma
Groupdirectories=Directories first
reverseorder=Reverse sort
closewindow=Close this window
Display=Display folder contents as
Folder=Mappa
Stack=Stack
Locatefolder=Directly open
FolderEffect=Folder display effect
Grid=Rács
Fan=Legyező
menufold=Menű

showmodeapps=Set MyDockFinder show/hide preferences when running
showmodedesktop=Set MyDockFinder show/hide preferences on desktop
NominiEffect=Do not show minimize animation for this app
nevershowprogress bar=Do not show progress bar for this app
showmodenormal=Follow settings
msgtips=Set up a message reminder
incognito=New incognito window

systemmenu=System context menu

timeskin=Select watch face
timedefault=Alapértelmezett

----------------------------------------------

[launchpad]

addicon=Ikon hozzáadása
deleteicon=Ikon törlése
padsortname=Rendezés név szerint
padsort=Icon autofill

search=Keresés
ok=Kész
addtips=Please drag .exe and .lnk files here to add them to Launchpad.
----------------------------------------------

[promptwindow]

;Empty trash can prompt and other prompts

ok=Igen
cancel=Nem
trashok=Igen
trashtitle=Are you sure you want to empty the items in the trash?
batterytip=Battery percentage low, your PC will power off soon if it does not get connected to a power supply.

eject=Volume ejected.
Connected=This volume is already connected.
brightnesstip=Adjusting the brightness of the monitor may cause permanent damage to the monitor, please do it with caution!
brightnesstip1=A monitor brightness of 0 is detected, if the monitor does not display content or does not click OK, reset the display brightness after 5 seconds


-----------------------------------------------
;Time format description
;ddd day of the week dddd day of the week M month d day H 24 hour format h 12 hour format m minutes s seconds
;Double letters with two digits for example  HH:mm:ss  09:06:05
;All the following formats can be customized and modified, and the number on the left can be added without limit = left blank to indicate that the date is not displayed
;After the modification is saved, it will take effect immediately, directly set and click the time format menu to display the effect
[formatdate]
1=
2=nnn
3=MMM d
4=MMM d ddd
5=ddd MMM d
6=ddd d MMM yyyy

[formattime]
1=Ó:pp
2=h:mm tt
3=H:mm:ss
4=h:mm:ss tt

[calicon]

;Calendar icon month text

m1=Jan
m2=Feb
m3=Már
m4=Ápr
m5=Máj
m6=Jún
m7=Júl
m8=Aug
m9=Szept
m10=Okt
m11=Nov
m12=Dec


[findermenu]
batteryhealth=Akkumulátor állapota:

Hidelyrics=Lejátszó dalszöveg automatikus elrejtése
Edit the lyrics display area=Dalszöveg megjelenítési terület szerkesztése

spatialaudio=Térbeli hang

bluetoothdisconnect=Kikapcsolás
bluetoothunpair=Eszköz törlése

lockscreen=A képernyő zárolása
usersetting=Fiókbeállítások

HideMenu=Hides the window menu bar
systemmenu=Window menu

bluetooth=Bluetooth
Bluetooth settings=Bluetooth settings
device=Eszköz
Preferred network=Jelenlegi hálózat
other networks=Egyéb hálózatok
network settings =Hálózati beállítások
Audio=Hang
output=Kimenet
Microphone=Mikrofon
input=Bemenet

audio settings=Audio settings
battery settings=Akkumulátor beállítások
BatteryEstimatedTime=Time on battery remaining
batterytime_hour=óra
batterytime_min=perc
Edit title=Edit title
Window border=Keep window border
end finder=Bezárás
About This PC=A PC névjegye
System settings=Rendszerbeállítások
app Store=Alkalmazás áruház
Task manager=Feladatkezelő
Sleep=Altatás
Dormant=Hibernálás
Shutdown=Leállítás
Reboot=Újraindítás
Shutdown&Update=Shut down and update
Reboot&Update=Reboot and update

Lock screen=Zárolás
Logout=Kijelentkezés

symbol=Show emoticons and symbols 
Screen Keyboard=Show on-screen keyboard
keyboardname=Show keyboard layout name
Keyboard settings=Keyboard settings
display=Kijelző
systemdark=Sötét mód
bluelight=Night Light
focusassist=Focus
focusoff=Disable focus
focusPriorityOnly=Only prioritized notifications
focusAlarmsOnly=Only alarms
Notification settings=Notification Settings
screen projection=Screen Mirroring
screen INTERNAL=Main screen only
screen CLONE=Duplicate
screen EXTEND=Expand
screen EXTERNAL=Secondary screen only

displayset=Kijelző beállítások
hotspot=Hotspot
airplane=Airplane Mode
deviceon=Device Connected
deviceoff=Device Not Connected
eject=Eject Device
open=Open

[findertips]
Mute=Némítás
battery=Akkumulátor
AcOnLine=Töltő csatlakoztatva
Charging=Töltés
notCharging=Nem töltődik
Usebattery=On battery power
Full battery=Akkumulátor feltöltve
brightness=Fényerő
show trayico=Show System Tray

[findertitle]

[findermenubrowser]
new=Új
newtab=Új lap
newwindow=Új ablak
favorites=Kedvencek
history=Előzmények
download=Letöltések
window=Ablak
file=Fájl
no file=No file selected

View=Nézet
Sort by=Sort by
Group by=Group by
refresh=Frissítés
showicons=Displays desktop icons

sort_none=Nincs
sort_bigicon=Large icons
sort_mediumicon=Medium icon
sort_smallicon=Small icons
sort_superbigicon=Oversized icons
sort_list=Lista
sort_details=Details
sort_tile=Tile
sort_content=Content
sort_name=Név
sort_size=Méret
sort_type=Tipus
sort_time=Dátum
sort_ascending=Ascending
sort_descending=Descending
sort_AutoArrange=Icons are arranged automatically
sort_snaptogrid=Automatically arrange icons aligned to the grid


[shutdown]
shutdown=Do you want to shut down your PC?
Reboot=Do you want to restart your PC?
Logout=Do you want to log out?
Dormant=Do you want to make your PC hibernate?
sleep=Do you want to put your PC to sleep?

now=most
minute=perc


[wifi]
password=Jelszó  
showpassword=Jelszó megjelenítése
join=Csatlakozás
cancel=Mégsem


[weather]
00=Napos
01=Felhős
02=Egész nap felhős
03=Rain showers
04=Thunder with rain showers
05=Thunderstorms with hail
06=Sleeting
07=Gyenge eső
08=Moderate rain
09=Heavy rain
10=Rainstorm
11=Heavy rain
12=Heavy rain
13=Snow showers
14=Light snowing
15=Slightly cloudy
16=Heavy snow
17=Blizzard
18=Foggy
19=Freezing rain
20=Homokvihar
21=Light-moderate rain
22=Moderate-heavy rain
23=Heavy rain
24=Heavy-moderate rain
25=Heavy-extreme rain
26=Small to medium snow
27=Moderate to heavy snow
28=Extreme blizzard
29=Floating dust
30=Homokvihar
31=Strong sandstorm
32=Dense fog
33=Havazás
49=Strong fog
53=Hazy
54=Moderately Hazy
55=Heavily hazy
56=Severely hazy
57=Heavy fog
58=Strong fog
301=Esős
302=Snowy